NOTE:
-----

진행하기 전에 다음의 셀을 실행시키고 가자.

Please run the below cells first before proceeding- you'll need them soon!

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [18]:
%%sql
DROP TABLE IF EXISTS Movies;
CREATE TABLE Movies(title VARCHAR(50), year INT, director VARCHAR(50), length INT);
INSERT INTO Movies VALUES('Database Wars', 1967, 'John Joe', 123);
INSERT INTO Movies VALUES('The Databaser', 1992, 'John Bob', 190);
INSERT INTO Movies VALUES('Database Wars', 1998, 'John Jim', 176);

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%sql DROP TABLE IF EXISTS A; DROP TABLE IF EXISTS B;
%sql CREATE TABLE A (x int, y int); CREATE TABLE B (x int, y int);
for i in range(1,6):
    %sql INSERT INTO A VALUES (:i, :i+1)
for i in range(1,11,3):
    %sql INSERT INTO B VALUES (:i, :i+2)

Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

활동 03a:
------------

ORDER BY 문법, 집합 연산자와 중첩 질의문

ORDER BY semantics, set operators & nested queries

In [20]:
%sql SELECT * FROM movies

Done.

[(u'Database Wars', 1967, u'John Joe', 123),
 (u'The Databaser', 1992, u'John Bob', 190),
 (u'Database Wars', 1998, u'John Jim', 176)]

문제 #1
-----------

**수업자료에 나온 영화 질의문을 하나의 SFW 질의문으로 바꿔보자**

**Can you write the movie query from lecture as a single SFW query?**

**한 번 이상 제목으로 사용된 모든 영화 제목들**을 찾는 것이 목표이다. 같은 해에는 같은 이름의 제목을 갖는 영화는 없었다고 가정하자. `movies` 테이블의 스키마는 다음과 같다:

Recall that we are trying to find **all movie titles that were used for more than one movie.** You may assume that no two movies in the same year have the same title. Our schema for the `movies` table is:



> * title STRING
> * year INT
> * director STRING
> * length INT

중첩 질의문으로 해결해보자:

Let's try to write the nested query that solves this from lecture:

In [21]:
%%sql
SELECT m.title 
FROM Movies m
WHERE m.year <> ANY(SELECT year FROM Movie WHERE title = m.title);

(sqlite3.OperationalError) near "SELECT": syntax error [SQL: u'SELECT m.title \nFROM Movies m\nWHERE m.year <> ANY(SELECT year FROM Movie WHERE title = m.title);']

어라? 동작을 안한다. 왜 그럴까?

What?  This doesn't work?  Why?


**ANY는 SQLite에서 지원하지 않는다!** 중첩을 쓰지 않고 해결할 수 있을까? 질의문을 아래에 작성해보자:

**ANY doesn't exist in SQLite!**  Can we do this query without nesting?  Write your query here:

In [ ]:
%%sql

문제 #2
--------------------

다음의 릴레이션 $A$ 와 $B$를 살펴보자:

Consider the two relations $A$ and $B$ below:

In [22]:
%sql SELECT * FROM A;

Done.

[(1, 2), (2, 3), (3, 4), (4, 5), (5, 6)]

In [23]:
%sql SELECT * FROM B;

Done.

[(1, 3), (4, 6), (7, 9), (10, 12)]

중복된 값이 없다는 가정 아래, **$x$ 속성에 대해서만** `INTERSECT` 또는 중첩 질의를 쓰지 않고`INTERSECT` 질의문의 결과를 출력하도록 작성해보자. 아래에 작성해보자:

Assuming no duplicates, can you write an `INTERSECT` query, **just over the $x$ attribute**, without using `INTERSECT` OR nested queries?  Write your query here:

In [ ]:
%%sql

이런 연산자를 무엇이라 부르는가?

다음으로는, 마찬가지로 집합 연산자를 사용 해서 해결해보자. 속성 $x$가 겹치는 $A$와 $B$의 모든 터플들을 돌려주는 질의문을 작성해보자. 아래에 작성해보자.

What is this operation called?

Next, using set operators again as well, can you return all the _full_ tuples in $A$ and $B$ that overlap in $x$ attributes?  Write your query here:

In [ ]:
%%sql